USE [BeltelecomDirectory]
GO
DBCC CHECKIDENT (Services, RESEED, 0);
INSERT INTO [dbo].[Services]
           ([Service_Name]
           ,[Price]
           ,[Service_Category_Type]
           ,[Category_ID]
		   ,[Description_ID])
     VALUES
	 --Интернет Юр лиц
           ('Базовый пакет'          
           ,50,1,1,1),
		   ('Средний пакет'
           
           ,100,1,1,2),
		   ('Профессиональный пакет'
           
           ,200,1,1,3),
		   ('Модульный пакет'
           
           ,0,1,1,4),
		   ('Корпоративный пакет'
           
           ,0,1,1,5),
		   ('Пакет с облачным хранилищем'
           
           ,150,1,1,6),
		   ('Пакет с антивирусной защитой'
           
           ,200,1,1,7),
		   ('Пакет с выделенным IP'
           
           ,300,1,1,8),
		   ('Пакет с резервным каналом'
           
           ,0,1,1,9),
		   ('Пакет с прокси-сервером'
           
           ,0,1,1,10),
		   --Интернет Физ лиц
		   ('Домашний интернет'
           
           ,15,0,1,11),
		   ('Wi-Fi для дома'
           
           ,7,0,1,12),
		   ('4G интернет для дома'
           
           ,10,0,1,13),
		   ('Домашний интернет + телевидение'
           
           ,30,0,1,14),
		   ('Интернет для путешествий'
           
           ,1,0,1,15),
		   ('Интернет для геймеров'
           
           ,20,0,1,16),
		   ('Интернет для работы из дома'
           
           ,15,0,1,17),
		   ('Интернет для стриминга'
           
           ,10,0,1,18),
		   ('Интернет для социальных сетей'
           
           ,5,0,1,19),
		   ('Интернет для обучения'
           
           ,10,0,1,20),

		   --Телевидение Физ лиц
		   ('Абонентское ТВ'
           
           ,7.20,0,2,21),
		   ('Комфортное ТВ'
           
           ,9.90,0,2,22),
		   ('Пакет ТВ+'
           
           ,15.20,0,2,23),
		   ('Премиальное ТВ'
           
           ,20,0,2,24),
		   ('Мультимания'
          
           ,8.60,0,2,25),
		   ('Кино и сериалы'
           
           ,10,0,2,26),
		   ('Спортивное ТВ'
           
           ,9.60,0,2,27),
		   ('Детское ТВ'
           
           ,5.60,0,2,28),

		   --Мобильная связь для Юр лиц

		   ('Безлимитный', 18,0, 3, 29),
		   ('Старт', 7.20,0, 3, 30),
		   ('Эконом', 10.80,0, 3, 31),
		   ('Премиум', 36.0,0, 3, 32),
		   ('Бизнес', 25.20,0, 3, 33),
		   ('Комфорт', 25.20,0, 3, 34),
		   ('Всё включено', 54.0,0, 3, 35),
		   ('Максимум', 28.80,0, 3, 36),
		   ('Корпоративный', 43.20,0, 3, 37),
		   ('VIP', 2000,0, 3, 38),
		   
		   --Мобильная связь для Физ лиц
		   ('Мини', 10,0 , 3, 39),
		   ('Стартовый', 20,0, 3, 40),
		   ('Любимый',  25,0, 3, 41),
		   ('Турбо', 30,0,3, 42),
		   ('VIP', 39,0,3, 43),
		   ('Комфортный', 40,0, 3, 44),
		   ('Ультра', 29.99,0, 3, 45),
		   ('Премиум',  29.99,0, 3, 46),
		   ('Домашний', 40,0, 3, 47);

GO


